Unidad08_Tarjetas/Practicas/Tarea_TarjetasPCI_Video.tex
% Created 2020-01-09 jue 09:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Angel Berlanas}
\date{\today}
\title{UD 08 - Tarea - Lanes PCI}
\hypersetup{
 pdfauthor={Angel Berlanas},
 pdftitle={UD 08 - Tarea - Lanes PCI},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\tableofcontents


\section{Presentación de la actividad}
\label{sec:org96d7d58}

Con lo explicado en clase + el vídeo que se indica en la tarea, responder a
las preguntas que se plantean en la tarea.

\href{https://www.youtube.com/watch?v=J4eSCMtaRuQ}{\{ YouTube \} - Líneas PCI}

\section{Ejercicio 01}
\label{sec:orgff5d226}

¿Cuantos \emph{buses pci express} hay en el diagrama?

\section{Ejercicio 02}
\label{sec:orgcbfe08c}

¿Donde se realiza el \emph{switching} de las líneas PCI express?

\section{Ejercicio 03}
\label{sec:org1ee9891}

¿Los puertos PCI express y las líneas deben ser las mismas?¿Porqué?

\section{Ejercicio 04}
\label{sec:org4b8b4ff}

¿Cuantas líneas dedicadas al Chipset es lo \emph{habitual}?

\section{Ejercicio 05}
\label{sec:org3304fdf}

¿Podríamos pasar de 16 lanes a 10 para el conector \texttt{x16}?¿Porqué?

\section{Ejercicio 06}
\label{sec:orged6fe37}

¿De que dos maneras se pueden comunicar con la CPU un Disco Duro \texttt{m.2}?

\section{Ejercicio 07}
\label{sec:org3dbf0bb}

En el vídeo aparecen los conceptos \emph{protocolo PCI express y SATA}, ¿Qué
diferencias hay en el uso de uno u otro por parte del dispositivo que lo
utiliza?

\section{Ejercicio 08}
\label{sec:org995bd0f}

¿Qué significan las siglas \emph{PCH} en el vídeo?¿De qué se encarga este
dispositivo?


\section{Ejercicio 09}
\label{sec:org134896c}

¿Sobre que voltaje trabaja \texttt{PCI-e}?

\section{Ejercicio 10}
\label{sec:org661eb4c}

Traduce el texto siguiente:

On June 18, 2019, PCI-SIG announced the development of PCI Express 6.0
specification. Bandwidth is expected to increase to 64 GT/s, yielding 128 GB/s
in each direction in a 16-lane configuration, with a target release date of
2021.The new standard uses 4-level pulse-amplitude modulation (PAM-4)
with a low-latency forward error correction (FEC) in place of
non-return-to-zero (NRZ) modulation.Unlike previous PCI Express versions,
forward error correction is used to increase data integrity and PAM-4 is used
as line code so that two bits are transferred per transfer. With 64 GT/s data
transfer rate (raw bit rate) and up to 256 GB/s via x16 configuration .


\section{Ejercicio 11}
\label{sec:org2c3163e}

¿Qué signficia \texttt{NRZ}?¿Qué es una modulación?

\section{Ejercicio 12}
\label{sec:org04f21b4}

Si tenemos una configuración \texttt{x16} de \emph{PCIexpress} en nuestro ordenador,
dependiendo de la versión de PCIe que usemos podremos obtener diferentes
anchos de banda. Elabora una tabla con:

\begin{center}
\begin{tabular}{llll}
Version & Voltaje & Potencia & Ancho de Banda\\
\hline
x16 & - & - & -\\
\end{tabular}
\end{center}


Cada fila ha de ser rellenadas con los datos referentes a una versión de \emph{PCIe}.
\end{document}
